src/main/resources/request/add-merchant-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:art="http://www.smile.com/merchant-ws">
   <soapenv:Header/>
   <soapenv:Body>
      <art:addMerchantRequest> 
		<art:merchantInfo>
	        <art:nameMerchant>TotoMerchant</art:nameMerchant>
	        <art:lastnameMerchant>TitiMerchant</art:lastnameMerchant>
	    </art:merchantInfo>
      </art:addMerchantRequest>
   </soapenv:Body>
</soapenv:Envelope>